{
  "info": "<h1>How the calories are calculated</h1><h2>Formulas</h2><h3>1. Basal Metabolic Rate</h3><p>First, your <a href='https://en.wikipedia.org/wiki/Basal_metabolic_rate'>Basal Metabolic Rate (BMR)</a> is calculated with the Mifflin St. Jeor equation based on your height, weight, age, and sex. BMR is how many calories your body needs to function while at rest.</p><h3>2. Total Daily Energy Expenditure</h3><p>Then, your BMR is multiplied by 1.2 to determine your Total Daily Energy Expenditure (TDEE), which is what your body needs to function throughout the day. To maintain your current weight, the daily calories you consume is equal to your TDEE.</p><h3>3. Exercise</h3><p>Your TDEE is then multiplied by a factor based on how much you exercise. The more you exercise, the more calories you burn. In turn, the more you exercise, the more calories you can consume and still maintain your current weight.</p><p>Daily exercise is defined as a 15–30 minute workout session where your heart rate is elevated. This includes jogging, biking, swimming, using an elliptical or treadmill, weight training.</p><h2>Weight loss and caloric deficit</h2><p>To lose weight, you need to consume fewer calories than you burn. One pound of body fat is roughly 3500 calories. So if you want to lose a pound per week, divide that number by 7 (for each day of the week) to get a daily caloric deficit of 500, which you then subtract from your average daily calories.</p><p>The same math applies to caloric deficits for other weekly weight loss goals:</p><table><thead><tr><th>Loss in lbs.</th><th>Daily</th><th>Weekly</th></tr></thead><tbody><tr><td>½</td><td>250</td><td>1750</td></tr><tr><td>1</td><td>500</td><td>3500</td></tr><tr><td>1½</td><td>750</td><td>5250</td></tr><tr><td>2</td><td>1000</td><td>7000</td></tr></tbody></table><h3>Zig-zag calories</h3><p>Over time, however, your metabolism will adjust to a consistent caloric deficit and weight loss will plateau. By varying your caloric intake from day to day (i.e., “zig-zagging”), your metabolism is effectively tricked into avoiding this plateau while achieving the same overall caloric deficit for the week.</p><h3>Minimum daily calories</h3><p>1200 is the minimum recommended number of calories to consume per day. Going below this number is not a wise move and this calculator will warn you if you select an unhealthy exercise and weight loss combination.</p><h2>Disclaimer</h2><p>I am not a medical, health, or nutrition professional. I’m just a developer who wanted to get in better shape.</p><p>I found the math behind caloric intake and weight loss interesting, so I decided to make a more user-friendly calorie calculator than the ones I found online.</p><p>I hope you find it helpful, and thanks for stopping by!</p><p>—Ben Gauslin</p>"
}
